app/Http/Controllers/Auth/PasswordController.php

    public function update(Request $request): RedirectResponse
    {
        $validated = $request->validateWithBag('updatePassword', [
            'current_password' => ['required', 'current_password'],
            'password' => ['required', Password::defaults(), 'confirmed'],
        ]);

        $request->user()->update([
            'password' => Hash::make($validated['password']),
        ]);
---
update "users" set "password" = '$2y$12$G3gDzuKsjnfL3oK6EJhzWuvYWDD780onOfTkarIBtCeZ0IERX0ha2', "updated_at" = '2024-04-11 07:49:46' where "id" = 2