app/Http/Controllers/Auth/RegisteredUserController.php

insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('test', 'test@test.com', '$2y$12$itzldvT6XDVzjAgAzOyN2OI1zbjpo6Hg7FqETvHv1FAPjo.Zrb6oe', '2024-04-11 12:29:08', '2024-04-11 12:29:08') returning "id"
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'regex:/^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{12,}$/'],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);