app/Http/Controllers/ProfileController.php

    public function update(ProfileUpdateRequest $request): RedirectResponse
    {
        $request->user()->fill($request->validated());

        if ($request->user()->isDirty('email')) {
            $request->user()->email_verified_at = null;
        }

        $request->user()->save();
---
update "users" set "email" = 'oui@oui.fr', "updated_at" = '2024-04-15 09:17:51' where "id" = 8